Revit 2027 API
DisplacementElement.CanElementsBeAddedToDisplacementSet Method
 Indicates if these elements can be displaced by this DisplacementElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanElementsBeAddedToDisplacementSet(
	ICollection<ElementId> toDisplace
)
Public Function CanElementsBeAddedToDisplacementSet (
	toDisplace As ICollection(Of ElementId)
) As Boolean
public:
bool CanElementsBeAddedToDisplacementSet(
	ICollection<ElementId^>^ toDisplace
)
member CanElementsBeAddedToDisplacementSet :
        toDisplace : ICollection<ElementId> -> bool
Parameters
toDisplace ICollection<ElementId>
 The elements to displace.
Return Value
Boolean
 True if the elements can be displaced by this DisplacementElement.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace